package main


// made by hand xD
const heartASCII = 
`💙💙💙💙💙💙💙💙💙
💙💙🩷🩷💙🩷🩷💙💙
💙🩷💙💙🩷💙💙🩷💙
💙🩷💙💙💙💙💙🩷💙
💙💙🩷💙💙💙🩷💙💙
💙💙💙🩷💙🩷💙💙💙
💙💙💙💙🩷💙💙💙💙
💙💙💙💙💙💙💙💙💙`

const heartASCIITransparent = 
`🔸🔸🔸🔸🔸🔸🔸🔸🔸
🔸🔸🩷🩷🔸🩷🩷🔸🔸
🔸🩷🔸🔸🩷🔸🔸🩷🔸
🔸🩷🔸🔸🔸🔸🔸🩷🔸
🔸🔸🩷🔸🔸🔸🩷🔸🔸
🔸🔸🔸🩷🔸🩷🔸🔸🔸
🔸🔸🔸🔸🩷🔸🔸🔸🔸
🔸🔸🔸🔸🔸🔸🔸🔸🔸`


const promptBox = 
`┌──────────────────────────────────┐
│ BF4L.NET / Gimme password...     │
├──────────────────────────────────┤
│ >                                │
└──────────────────────────────────┘
`

const promptBoxPromptRelativeOffsetX = 4
const promptBoxPromptRelativeOffsetY = -2